# Formulae
brew "fd"               # find but better
brew "bat"              # cat but better
brew "eza"              # Better ls
brew "fzf"              # fuzzy finding
brew "git"              # git gud
brew "gum"              # tool for fancy bash clis
brew "qsv"              # CSV manipulation tool
brew "curl"             # universal http tool
brew "nmap"             # network tool
brew "procs"            # better ps command
brew "gnupg"            # Used for gpg signing commits
brew "yabai"            # Tiling window manager
brew "bottom"           # top but better
brew "neovim"           # vim but neo
brew "zellij"           # tmux alternative
brew "gnu-sed"          # a sed that matches unix compliant systems
brew "ripgrep"          # grep but better
brew "tealdeer"         # man pages but better
brew "topgrade"         # system updater
brew "starship"         # zsh prompt
brew "ca-certificates"  # certs

# Casks -----------------------------------------------------------------------
cask "zed"              # A decent editor
cask "ghostty"          # Better terminal
cask "firefox"          # A open source browser
cask "obsidian"         # Note taking and knowledge graph
cask "proton-pass"      # Password manager
cask "google-chrome"    # A really bad browser by a really bad company
cask "docker-desktop"   # Docker
